pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/stepResponseFluidizedBed/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    vin_DB
    {
        type               interstitialInletVelocity;
        inletVelocity      uniform (0 0 0.63);
        alpha              alpha.air;
        value              $internalField;
    }

    pout
    {
        type               pressureInletOutletVelocity;
        phi                phi.air;
        value              $internalField;
    }

   w_F
    {
        type               cyclic;
    }
    w_B
    {
        type               cyclic;
    }
    w_L
    {
        type               cyclic;
    }
    w_R
    {
        type               cyclic;
    }
}

// ************************************************************************* //
