pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/SATFM/stepResponseFluidizedBed/system/blockMeshDict_8
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices 
(
    (-0.075 -0.02 0.00)
    ( 0.075 -0.02 0.00)
    ( 0.075  0.02 0.00)
    (-0.075  0.02 0.00)
    (-0.075 -0.02 1.50)
    ( 0.075 -0.02 1.50)
    ( 0.075  0.02 1.50)
    (-0.075  0.02 1.50)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (23 10 150) 
    simpleGrading
    (
       (
           (0.1 0.2 4)
           (0.8 0.6  1)
           (0.1 0.2 0.25)
	)
       (
           (0.25 0.40 4)
           (0.5  0.2  1)
           (0.25 0.40 0.25)
	)
       1
     )
);

edges
(
);

patches
(
    patch vin_DB
    (
	(0 3 2 1)
    )
    patch pout
    (
        (4 5 6 7)
    )
    wall w_FB
    (
	(0 3 7 4)
	(1 5 6 2)
	(0 1 4 5)
	(2 6 7 3)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
